## Lahman Basball in Python

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# establish a database connection
engine = create_engine("postgres+psycopg2://postgres:Postgres@localhost:5432/Lahman_Baseball")

# use the connection to run a query using pandas!
batting = pd.read_sql("SELECT * FROM batting;", con=engine)
batting.head()

,playerid,yearid,stint,teamid,lgid,g,ab,r,h,h2b,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
0,abercda01,1871,1,TRO,NA,1,4,0,0,0,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NA,25,118,30,32,6,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,NaN
2,allisar01,1871,1,CL1,NA,29,137,28,40,4,...,19.0,3.0,1.0,2,5.0,NaN,NaN,NaN,NaN,NaN
3,allisdo01,1871,1,WS3,NA,27,133,28,44,10,...,27.0,1.0,1.0,0,2.0,NaN,NaN,NaN,NaN,NaN
4,ansonca01,1871,1,RC1,NA,25,120,29,39,11,...,16.0,6.0,2.0,2,1.0,NaN,NaN,NaN,NaN,NaN

## 1. Find all players in the database who played at Vanderbilt University. 
- Create a list showing each player’s first and last names as well as the total salary they earned in the major leagues.
- Sort this list in descending order by the total salary earned. 
- Which Vanderbilt player earned the most money in the majors?

In [3]:
## read in 'people' table
people = pd.read_sql("SELECT playerid, namefirst, namelast FROM people;", con=engine)
people.head()

    playerid namefirst namelast
0  aardsda01     David  Aardsma
1  aaronha01      Hank    Aaron
2  aaronto01    Tommie    Aaron
3   aasedo01       Don     Aase
4   abadan01      Andy     Abad

In [4]:
full_name = people['namefirst'] + ' ' + people['namelast']
people['namefull'] = full_name

In [5]:
## read in 'collegeplaying' table
college_playing = pd.read_sql("SELECT * FROM collegeplaying;", con=engine)

In [6]:
## read in 'salaries' table and join to people
salaries = pd.read_sql("SELECT * FROM salaries;", con=engine)
player_info = pd.merge(people, salaries, on = 'playerid')

In [7]:
## join college info to dataframe
player_info = pd.merge(player_info, college_playing, on = 'playerid')  ##.drop('yearid', axis=1)
player_info.head()

,playerid,namefirst,namelast,namefull,yearid_x,teamid,lgid,salary,schoolid,yearid_y
0,aardsda01,David,Aardsma,David Aardsma,2004,SFN,NL,300000.0,pennst,2001
1,aardsda01,David,Aardsma,David Aardsma,2004,SFN,NL,300000.0,rice,2002
2,aardsda01,David,Aardsma,David Aardsma,2004,SFN,NL,300000.0,rice,2003
3,aardsda01,David,Aardsma,David Aardsma,2007,CHA,AL,387500.0,pennst,2001
4,aardsda01,David,Aardsma,David Aardsma,2007,CHA,AL,387500.0,rice,2002

In [10]:
## Create a list of players that played for 'Vandy'
vandy_players = player_info.loc[player_info['schoolid'] == 'vandy']
vandy_grouped = vandy_players.groupby(by = ['namefull'])['salary'].sum()
vandy_grouped.head()

namefull
David Price      245553888.0
Jensen Lewis       3702000.0
Jeremy Sowers      1154400.0
Joey Cora         16867500.0
Josh Paul          7920000.0
Name: salary, dtype: float64

In [12]:
vandy_grouped.sort_values(ascending = False).to_frame().reset_index()

           namefull       salary
0       David Price  245553888.0
1     Pedro Alvarez   62045112.0
2   Scott Sanderson   21500000.0
3        Mike Minor   20512500.0
4         Joey Cora   16867500.0
5        Mark Prior   12800000.0
6     Ryan Flaherty   12183000.0
7         Josh Paul    7920000.0
8        Sonny Gray    4627500.0
9       Mike Baxter    4188836.0
10     Jensen Lewis    3702000.0
11        Matt Kata    3180000.0
12  Nick Christiani    2000000.0
13    Jeremy Sowers    1154400.0
14   Scotti Madison     540000.0

## 2. Using the fielding table, group players into three groups based on their position: 
- label players with position OF as "Outfield", 
- label players with position "SS", "1B", "2B", and "3B" as "Infield", 
- label players with position "P" or "C" as "Battery". 

## Determine the number of putouts made by each of these three groups in 2016.